import fs from 'fs'; // تأكد من استيراد fs في حالة استخدامه

const handler = async (m, { conn }) => {
  await conn.sendMessage(m.chat, { react: { text: "🤔",key: m.key,}
  })
  global.verdad = [
    "هل تؤمن بالأشباح",
    "هل تؤمن بالحياة خارج كوكب الأرض",
    "هل سبق لك أن كتبت أغنية لشخص ما",
    "هل شاركت في لعبة اختبار أو مسابقة",
    "هل تحب لقاء أشخاص جدد",
    "هل تحب مساعدة الناس",
    "ماذا تفعل إذا تم لومك ظلماً على شيء لم تفعله",
    "كم من الوقت تشتغرق لتهدأ عندما تكون غاضباً",
    "هل تشعر بخيبة أمل بسهولة",
    "هل تساعد الناس فقط إذا كنت تعتقد أنك ستحصل على شيء في المقابل",
    "هل تضع أهداف طويلة المدى",
    "هل تندهش بسهولة",
    "ما هو الشيء الذي يضايقك بشدة في الآخرين",
    "ما هي نقاط قوتك وضعفك",
    "ما هي أصعب تجربة مررت بها في حياتك",
    "ما الذي يلهمك للمضي قدماً عندما تصبح الأمور صعبة",
    "ما هو الشيء الذي تخاف منه وكيف تتعامل مع هذا الخوف",
    "ما هي المهارة أو الهواية التي تود تعلمها وتطويرها أكثر",
    "إذا كان بإمكانك تغيير شيء واحد في حياتك فما هو",
    "هل سبق وكذبت كذبة كبيرة وخطيرة جداً",
    "هل سبق ورفعت صوتك على والديك",
    "هل سبق وفعلت شيئاً ندمت عليه لدرجة أنك تمنيت الموت لنفسك",
    "هل أنت عصبي",
    "هل سبق وقلت في نفسك - يا ليت كنت ..",
    "هل يمكن السفر عبر الزمن",
    "متى أعجبت بأول فتاة/شاب في حياتك",
    "صف نفسك في كلمة واحدة",
    "ما هي الصفات الجميلة في شخصيتك",
    "هل أنت راضي عن نفسك وعن كل ما حققته في حياتك",
    "من هو الشخص الذي تفكر فيه طوال الوقت",
    "هل تؤمن بالحب غير المشروط",
    "هل كانت لديك علاقة سيئة في الماضي",
    "هل سبق لك أن انفصلت عن شخص ما عبر رسالة نصية",
    "هل سبق أن نسيت عيد ميلاد شريكك",
    "هل سبق لك أن قلت كذبة بيضاء لشريكك",
    "ما هو أكثر شيء تخجل منه",
    "هل سبق لك أن خنت أحد الأصدقاء",
    "ما هو أكبر سر تحتفظ به",
    "من هو الشخص الذي تشعر بالغيرة منه ولماذا",
    "ما هو الشيء الأكثر جرأة الذي قمت به",
    "هل سبق لك أن أحببت شخصاً لا تستطيع أن تكون معه",
    "كيف يبدو الحب بالنسبة لك",
    "ما هو المعتقد الذي تؤمن به ويختلف معه الكثير من الناس",
    "ما هو الشيء الوحيد عن المستقبل الذي يخيفك"
  ];

  const question = pickRandom(global.verdad);
  const message = `*⟆👾⟅ الــصــراحــة*

- *🔱 ${question}*
\n*ʙy:ᴛᴀɴᴊɪʀᴏ𖣬ʙᴏᴛ*`;

  const imagePath = './PCB/اسئلني.jpg'; // تعريف مسار الصورة الجديد

  // تحقق من وجود الصورة وأرسلها مع الرسالة
  if (fs.existsSync(imagePath)) {
    const imageBuffer = fs.readFileSync(imagePath);
    conn.sendMessage(m.chat, { image: imageBuffer, caption: message }, { quoted: m });
  } else {
    console.log(`File not found at ${imagePath}`);
    conn.reply(m.chat, 'الصورة المطلوبة غير موجودة.', m);
  }
};

handler.help = ['اسئلني'];
handler.tags = ['fu'];
handler.command = /^اسئلني/i;
export default handler;

function pickRandom(list) {
  return list[Math.floor(Math.random() * list.length)];
}