import fs from 'fs'; // استيراد مكتبة fs للتعامل مع الملفات

// قائمة الأوامر والرسائل المرتبطة بها
const commandMessages = {
  "استمارة_بلاك": `*مرحباً بكم في مملكة بلاك🕷️ديفل*

*⚕ ✦═══❘ ⋞🕷️⋟ ❘═══✦ ⚕*

*⚚ الـلـقـب ⋞  ⋟*

*⚚ من الأنمي أو الأفلام ⋞  ⋟*

*⚚ من طرف ⋞  ⋟*

*⚚ جنسك ⋞  ⋟*

*⚚ صورة الشخصية ⋞  ⋟*

*♆ ♛┈⛧┈┈•༶ ⋞🕷️⋟ •┈┈⛧┈♛ ⚚*

*⚚ يمكنك اختيار لقب شخصية من مانغا أو مانهوا 🕷️*

*⚚ ممنوع اختيار لقب لشخصية عكس جنسك🚫*

*⚚ ممنوع اختيار أي لقب لشخصية من تصنيفات هينتاي أو إيشي 🚫*

*☤ ˙·٠•●۩۩ஜ♦ ⋞🕷️⋟𖢦 ♦ஜ۩۩●•٠·˙ ☤*
*⚔ مع تحيات إدارة المملكة ⚔*
*🕸️𝘽.𝙇.𝙆🕸️*`,
  "ترحيب_بلاك": `*مـرحـبـاً بـــك فــي مـمـلـكـة بــلــاك🕷️ديــفــل*

*⚕ ✦═══❘ ⋞🕷️⋟ ❘═══✦ ⚕*

*حقيقي مبسوطين بانضمامك لينا في 【بــلـاك ديــفــل】 هنا هتلاقي ناس زيك يحبوا نفس اهتماماتك وهنقضي مع بعض أحلى الأوقات جهز نفسك للمتعة والإثارة 😈🖤*

*⚕ ✦═══❘ ⋞🕷️⋟ ❘═══✦ ⚕*

*⚔ قوانين المملكة ⚔*

*⚖️ الاحتكاك بأي شكل ممنوع.*

*⚖️ سب أي ديانة يعرضك للعقوبة المؤبدة.*

*⚖️ السب مرفوض تماماً.*

*⚖️ ممنوع مناقشة أي أمور سياسية.*

*⚖️ طلب الإشراف أو الرتب مش مسموح، لو كنت نشيط هتترقى تلقائيًا.*

*⚖️ إرسال صور أو ملصقات دموية أو غير لائقة ممنوع تماماً.*

*♆ ♛┈⛧┈┈•༶ ⋞🕷️⋟ •┈┈⛧┈♛ ⚚*

*☤ ˙·٠•●۩۩ஜ♦ ⋞🕷️⋟𖢦 ♦ஜ۩۩●•٠·˙ ☤*

*⚔ مع تحيات إدارة المملكة ⚔*  
*🕸️𝘽.𝙇.𝙆🕸️*`,
  "قوانين_بلاك": `*⚕ ✦═══❘ ⋞🕷️⋟ ❘═══✦ ⚕*

*⚔ قوانين المملكة ⚔*

*⚖️ الاحتكاك بأي شكل ممنوع.*

*⚖️ سب أي ديانة يعرضك للعقوبة المؤبدة.*

*⚖️ السب مرفوض تماماً.*

*⚖️ ممنوع مناقشة أي أمور سياسية.*

*⚖️ طلب الإشراف أو الرتب مش مسموح، لو كنت نشيط هتترقى تلقائيًا.*

*⚖️ إرسال صور أو ملصقات دموية أو غير لائقة ممنوع تماماً.*

*♆ ♛┈⛧┈┈•༶ ⋞🕷️⋟ •┈┈⛧┈♛ ⚚*

*☤ ˙·٠•●۩۩ஜ♦ ⋞🕷️⋟𖢦 ♦ஜ۩۩●•٠·˙ ☤*

*⚔ مع تحيات إدارة المملكة ⚔*  
*🕸️𝘽.𝙇.𝙆🕸️*`
};

const handler = (m) => m; // تعريف دالة المعالجة التي تعيد الرسالة كما هي

handler.all = async function(m) { // إضافة خاصية 'all' للدالة handler وتعريف دالة غير متزامنة لمعالجة الرسائل
  const chat = global.db.data.chats[m.chat]; // استخراج بيانات الدردشة من قاعدة البيانات العالمية

  // إذا كانت الدردشة غير محظورة وكان النص المكتوب من الأوامر المحددة
  if (commandMessages[m.text] && !chat.isBanned) {
    conn.sendPresenceUpdate('recording', m.chat); // تحديث حالة الاتصال إلى "تسجيل"
    const message = commandMessages[m.text]; // الحصول على الرسالة المرتبطة بالأمر
    await m.reply(message); // إرسال الرسالة المرتبطة بالأمر
    
    // إرسال تفاعل مع الرسالة
    await conn.sendMessage(m.chat, { 
      react: { text: "🔱", key: m.key } 
    });
  }
  return !0; // إرجاع القيمة true
};

export default handler;