import fs from 'fs'; // استيراد مكتبة fs للتعامل مع الملفات

const messages = [ // قائمة الرسائل الممكن إرسالها
  '🔱 *اي يا حب عامل اي*',
  '🔱 *انا موجود مين محتاجني*',
  '🔱 *كيف الحال والاحوال*',
  '🔱 *كفايا كرهت اني بوت*',
  '🔱 *ارحمني بالله عليك انا تعبت ورايا شغل سيبني في حالي*',
  '🔱 *خلاص ارحمني اقولق روح كلم المطور ❴ wa.me/201220864180 ❵*',
  '🔱 *اؤمرني يا عسل*',
  '🔱 *مين عايزني انا في الخدمه اهو*',
  '🔱 *انا خارج نطاق الخدمه سلام*',
  '🔱 *اوقات اكره اليوم الي تانجيرو طورني في*',
  '🔱 *هلا بلمز كيفك*',
  '🔱 *عامل اي يا عسل وحشني*',
  '🔱 *سيبني نايم شويه*',
  '🔱 *روح شوف غيري انا اعتزلت*',
  '🔱 *شو يعني مالك البوتات ما تقدر ترتاح ساعتين بدون ازعاج يعني*',
  '🔱 *امممممم عايز اي يا قمر*',
  '🔱 *شمس استطعت والجو جميل هذا اليوم*',
  '🔱 *ممكن تتركني ارتاح بليز*',
  '🔱 *بحبك بس سيبني انام شويه معلش انا تعبت اوامر كفاك اوامر لليوم*',
  '🔱 *اكتب .الاوامر عشان تشوف المنيو سيبني انا بقا ارتاح*',
  '🔱 *من يعشق البحر ويحبه الناس*'
];

const handler = (m) => m; // تعريف دالة المعالجة التي تعيد الرسالة كما هي

handler.all = async function(m) { // إضافة خاصية 'all' للدالة handler وتعريف دالة غير متزامنة لمعالجة الرسائل
  const chat = global.db.data.chats[m.chat]; // استخراج بيانات الدردشة من قاعدة البيانات العالمية

  // إذا كانت الرسالة تحتوي على النص "بوت" (بغض النظر عن الحالة) والدردشة غير محظورة
  if (/^بوت$/i.test(m.text) && !chat.isBanned) {
    conn.sendPresenceUpdate('recording', m.chat); // تحديث حالة الاتصال إلى "تسجيل"
    const randomMessage = messages[Math.floor(Math.random() * messages.length)]; // اختيار رسالة عشوائية
    await m.reply(randomMessage); // إرسال الرسالة العشوائية
    
    // إرسال تفاعل مع الرسالة
    await conn.sendMessage(m.chat, { 
      react: { text: "🔱", key: m.key } 
    });
  }
  return !0; // إرجاع القيمة true
};

export default handler; // تصدير الدالة handler كالتصدير الافتراضي من هذا الملف