import fs from 'fs'; // استيراد مكتبة fs للتعامل مع الملفات

const messages = [ // قائمة الرسائل الممكن إرسالها
  '🔱 *اؤمرني يا عسل موجود اهو*',
  '🔱 *نعم*',
  '🔱 *حرفيا نفسي ارتاح نص ساعه علي بعض ارحمني*',
  '🔱 *اممممم خير في اي*',
  '🔱 *تانجيرو تانجيرو تانجيرو هو مفيش غيري ياسطا*',
  '🔱 *قلبو نعم*',
  '🔱 *مشغول دلوقت🤤*',
  '🔱 *مين عايزني انا في الخدمه اهو*',
  '🔱 *احا بجد مخلاص ياسطا هو الكيبورد بتاعك مفيهوش غير حروف اسمي*',
  '🔱 *تبا للأرهاق ارحمني*',
  '🔱 *اسكت شويه😑*',
  '🔱 *ياسطا روح اعملحاجه مفيده بقا انت موركش غيري*',
  '🔱 *بحارب شيطان دلوقت يا حب مش فاضي تعا بعدين*',
  '🔱 *برأيك في امل ابقا هشيرا*',
  '🔱 *يا ترا موزان هيعمل فينا اي انا والهشيرا شاغل تفكيري الموضوع دا*',
  '🔱 *خلااااااااااااااص اسكتتتتتتت🤐*',
  '🔱 *ياتي بطه عاوز اي من تانجيرو يا عسل*',
  '🔱 *ها عايش للأسف يعني*',
  '🔱 *اممممممم برأيك مطوري قمور*',
  '🔱 *تبا للعالم لا يوجد راحه للأبد ها عايز اي*',
  '🔱 *الي مفكره نفسها شغلاني كمل انت بقا*'
];

const handler = (m) => m; // تعريف دالة المعالجة التي تعيد الرسالة كما هي

handler.all = async function(m) { // إضافة خاصية 'all' للدالة handler وتعريف دالة غير متزامنة لمعالجة الرسائل
  const chat = global.db.data.chats[m.chat]; // استخراج بيانات الدردشة من قاعدة البيانات العالمية

  // إذا كانت الرسالة تحتوي على النص "بوت" (بغض النظر عن الحالة) والدردشة غير محظورة
  if (/^تانجيرو$/i.test(m.text) && !chat.isBanned) {
    conn.sendPresenceUpdate('recording', m.chat); // تحديث حالة الاتصال إلى "تسجيل"
    const randomMessage = messages[Math.floor(Math.random() * messages.length)]; // اختيار رسالة عشوائية
    await m.reply(randomMessage); // إرسال الرسالة العشوائية
    
    // إرسال تفاعل مع الرسالة
    await conn.sendMessage(m.chat, { 
      react: { text: "🔱", key: m.key } 
    });
  }
  return !0; // إرجاع القيمة true
};

export default handler;